STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231fxx_cm33.h
/* Bit fields for USB3_GDBGFIFOSPACE register */
#define USB3_GDBGFIFOSPACE_FIFO_QUEUE_SELECT_Pos                 0
#define USB3_GDBGFIFOSPACE_FIFO_QUEUE_SELECT_Msk                 (0x1ffUL << 0)
#define USB3_GDBGFIFOSPACE_FIFO_QUEUE_SELECT                     (0x1ffUL << 0)
#define USB3_GDBGFIFOSPACE_SPACE_AVAILABLE_Pos                   16
#define USB3_GDBGFIFOSPACE_SPACE_AVAILABLE_Msk                   (0xffffUL << 16)
#define USB3_GDBGFIFOSPACE_SPACE_AVAILABLE                       (0xffffUL << 16)

/* Bit fields for USB3_GDBGLTSSM register */
#define USB3_GDBGLTSSM_TXONESZEROS_Pos                           0
#define USB3_GDBGLTSSM_TXONESZEROS_Msk                           (0x1UL << 0)
#define USB3_GDBGLTSSM_TXONESZEROS                               (0x1UL << 0)
#define USB3_GDBGLTSSM_RXTERMINATION_Pos                         1
#define USB3_GDBGLTSSM_RXTERMINATION_Msk                         (0x1UL << 1)
#define USB3_GDBGLTSSM_RXTERMINATION                             (0x1UL << 1)
#define USB3_GDBGLTSSM_TXSWING_Pos                               2
#define USB3_GDBGLTSSM_TXSWING_Msk                               (0x1UL << 2)
#define USB3_GDBGLTSSM_TXSWING                                   (0x1UL << 2)
#define USB3_GDBGLTSSM_LTDBClkState_Pos                          3
#define USB3_GDBGLTSSM_LTDBClkState_Msk                          (0x7UL << 3)
#define USB3_GDBGLTSSM_LTDBClkState                              (0x7UL << 3)
#define USB3_GDBGLTSSM_TXDEEMPHASIS_Pos                          6
#define USB3_GDBGLTSSM_TXDEEMPHASIS_Msk                          (0x3UL << 6)
#define USB3_GDBGLTSSM_TXDEEMPHASIS                              (0x3UL << 6)
#define USB3_GDBGLTSSM_RXEQTRAIN_Pos                             8
#define USB3_GDBGLTSSM_RXEQTRAIN_Msk                             (0x1UL << 8)
#define USB3_GDBGLTSSM_RXEQTRAIN                                 (0x1UL << 8)
#define USB3_GDBGLTSSM_POWERDOWN_Pos                             9
#define USB3_GDBGLTSSM_POWERDOWN_Msk                             (0x3UL << 9)
#define USB3_GDBGLTSSM_POWERDOWN                                 (0x3UL << 9)
#define USB3_GDBGLTSSM_LTDBPhyCmdState_Pos                       11
#define USB3_GDBGLTSSM_LTDBPhyCmdState_Msk                       (0x7UL << 11)
#define USB3_GDBGLTSSM_LTDBPhyCmdState                           (0x7UL << 11)
#define USB3_GDBGLTSSM_TxDetRxLoopback_Pos                       14
#define USB3_GDBGLTSSM_TxDetRxLoopback_Msk                       (0x1UL << 14)
#define USB3_GDBGLTSSM_TxDetRxLoopback                           (0x1UL << 14)
#define USB3_GDBGLTSSM_RXPOLARITY_Pos                            15
#define USB3_GDBGLTSSM_RXPOLARITY_Msk                            (0x1UL << 15)
#define USB3_GDBGLTSSM_RXPOLARITY                                (0x1UL << 15)
#define USB3_GDBGLTSSM_TXELECLDLE_Pos                            16
#define USB3_GDBGLTSSM_TXELECLDLE_Msk                            (0x1UL << 16)
#define USB3_GDBGLTSSM_TXELECLDLE                                (0x1UL << 16)
#define USB3_GDBGLTSSM_ELASTICBUFFERMODE_Pos                     17
#define USB3_GDBGLTSSM_ELASTICBUFFERMODE_Msk                     (0x1UL << 17)
#define USB3_GDBGLTSSM_ELASTICBUFFERMODE                         (0x1UL << 17)
#define USB3_GDBGLTSSM_LTDBSUBSTATE_Pos                          18
#define USB3_GDBGLTSSM_LTDBSUBSTATE_Msk                          (0xfUL << 18)
#define USB3_GDBGLTSSM_LTDBSUBSTATE                              (0xfUL << 18)
#define USB3_GDBGLTSSM_LTDBLINKSTATE_Pos                         22
#define USB3_GDBGLTSSM_LTDBLINKSTATE_Msk                         (0xfUL << 22)
#define USB3_GDBGLTSSM_LTDBLINKSTATE                             (0xfUL << 22)
#define USB3_GDBGLTSSM_LTDBTIMEOUT_Pos                           26
#define USB3_GDBGLTSSM_LTDBTIMEOUT_Msk                           (0x1UL << 26)
#define USB3_GDBGLTSSM_LTDBTIMEOUT                               (0x1UL << 26)
#define USB3_GDBGLTSSM_PRTDIRECTION_Pos                          27
#define USB3_GDBGLTSSM_PRTDIRECTION_Msk                          (0x1UL << 27)
#define USB3_GDBGLTSSM_PRTDIRECTION                              (0x1UL << 27)
#define USB3_GDBGLTSSM_X3_DS_HOST_SHUTDOWN_Pos                   28
#define USB3_GDBGLTSSM_X3_DS_HOST_SHUTDOWN_Msk                   (0x1UL << 28)
#define USB3_GDBGLTSSM_X3_DS_HOST_SHUTDOWN                       (0x1UL << 28)
#define USB3_GDBGLTSSM_X3_XS_SWAPPING_Pos                        29
#define USB3_GDBGLTSSM_X3_XS_SWAPPING_Msk                        (0x1UL << 29)
#define USB3_GDBGLTSSM_X3_XS_SWAPPING                            (0x1UL << 29)
#define USB3_GDBGLTSSM_RxElecidle_Pos                            30
#define USB3_GDBGLTSSM_RxElecidle_Msk                            (0x1UL << 30)
#define USB3_GDBGLTSSM_RxElecidle                                (0x1UL << 30)

/* Bit fields for USB3_GDBGLNMCC register */
#define USB3_GDBGLNMCC_LNMCC_BERC_Pos                            0
#define USB3_GDBGLNMCC_LNMCC_BERC_Msk                            (0x1ffUL << 0)
#define USB3_GDBGLNMCC_LNMCC_BERC                                (0x1ffUL << 0)

/* Bit fields for USB3_GDBGBMU register */
#define USB3_GDBGBMU_BMU_CCU_Pos                                 0
#define USB3_GDBGBMU_BMU_CCU_Msk                                 (0xfUL << 0)
#define USB3_GDBGBMU_BMU_CCU                                     (0xfUL << 0)
#define USB3_GDBGBMU_BMU_DCU_Pos                                 4
#define USB3_GDBGBMU_BMU_DCU_Msk                                 (0xfUL << 4)
#define USB3_GDBGBMU_BMU_DCU                                     (0xfUL << 4)
#define USB3_GDBGBMU_BMU_BCU_Pos                                 8
#define USB3_GDBGBMU_BMU_BCU_Msk                                 (0xffffffUL << 8)
#define USB3_GDBGBMU_BMU_BCU                                     (0xffffffUL << 8)

/* Bit fields for USB3_GDBGLSPMUX_HST register */
#define USB3_GDBGLSPMUX_HST_HOSTSELECT_Pos                       0
#define USB3_GDBGLSPMUX_HST_HOSTSELECT_Msk                       (0x3fffUL << 0)
#define USB3_GDBGLSPMUX_HST_HOSTSELECT                           (0x3fffUL << 0)
#define USB3_GDBGLSPMUX_HST_logic_analyzer_trace_Pos             16
#define USB3_GDBGLSPMUX_HST_logic_analyzer_trace_Msk             (0xffUL << 16)
#define USB3_GDBGLSPMUX_HST_logic_analyzer_trace                 (0xffUL << 16)

/* Bit fields for USB3_GDBGLSP register */
#define USB3_GDBGLSP_LSPDEBUG_Pos                                0
#define USB3_GDBGLSP_LSPDEBUG_Msk                                (0xFFFFFFFFUL << 0)
#define USB3_GDBGLSP_LSPDEBUG                                    (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_GDBGEPINFO0 register */
#define USB3_GDBGEPINFO0_EPDEBUG_Pos                             0
#define USB3_GDBGEPINFO0_EPDEBUG_Msk                             (0xFFFFFFFFUL << 0)
#define USB3_GDBGEPINFO0_EPDEBUG                                 (0xFFFFFFFFUL << 0)

