STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231fxx_cm33.h
/******************************* HASH Instances ********************************/
#define IS_HASH_DIGEST_ALL_INSTANCE(INSTANCE) (((INSTANCE) == HASH1_DIGEST_S) || ((INSTANCE) == HASH1_DIGEST_NS) || \
                                               ((INSTANCE) == HASH2_DIGEST_S) || ((INSTANCE) == HASH2_DIGEST_NS))

/******************************* HSEM Instances *******************************/
#define IS_HSEM_ALL_INSTANCE(INSTANCE) (((INSTANCE) == HSEM_S) || ((INSTANCE) == HSEM_NS))
/*********************  Bit definition for HSEM_CR register  ******************/
#define HSEM_CPU1_COREID    (0x00000001UL) /* Semaphore Core CA35 ID */
#define HSEM_CPU2_COREID    (0x00000002UL) /* Semaphore Core CM33 ID */
#define HSEM_CPU3_COREID    (0x00000003UL) /* Semaphore Core CM0PLUS ID */
#define HSEM_CR_COREID_CURRENT   (HSEM_CPU2_COREID << HSEM_CR_COREID_Pos)

#define HSEM_SEMID_MIN     (0U)       /* HSEM ID Min*/
#define HSEM_SEMID_MAX     (15U)      /* HSEM ID Max */

#define HSEM_PROCESSID_MIN (0U)       /* HSEM Process ID Min */
#define HSEM_PROCESSID_MAX (255U)     /* HSEM Process ID Max */

#define HSEM_CLEAR_KEY_MIN (0U)       /* HSEM clear Key Min value */
#define HSEM_CLEAR_KEY_MAX (0xFFFFU)  /* HSEM clear Key Max value */

/******************************* ICACHE Instances *******************************/
#define IS_ICACHE_ALL_INSTANCE(INSTANCE) (((INSTANCE) == ICACHE_S) || ((INSTANCE) == ICACHE_NS))

/******************************** I3C Instances *******************************/
#define IS_I3C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I3C1_NS) || ((INSTANCE) == I3C1_S) || \
                                       ((INSTANCE) == I3C2_NS) || ((INSTANCE) == I3C2_S) || \
                                       ((INSTANCE) == I3C4_NS) || ((INSTANCE) == I3C4_S))

/******************************** I2C Instances *******************************/
#define IS_I2C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_S) || ((INSTANCE) == I2C1_NS) || \
                                       ((INSTANCE) == I2C2_S) || ((INSTANCE) == I2C2_NS) || \
                                       ((INSTANCE) == I2C7_S) || ((INSTANCE) == I2C7_NS) || \
                                       ((INSTANCE) == I2C8_S) || ((INSTANCE) == I2C8_NS))

/******************* I2C Instances : Group belongingness *********************/
#define IS_I2C_GRP1_INSTANCE(INSTANCE) (((INSTANCE) == I2C8_NS) || ((INSTANCE) == I2C8_S)) 

/************** I2C Instances : wakeup capability from stop modes *************/
#define IS_I2C_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) IS_I2C_ALL_INSTANCE(INSTANCE)

/************** I2C Instances : trigger input *********************************/
#define IS_I2C_TRIGGER_INPUT_INSTANCE(INSTANCE) IS_I2C_GRP1_INSTANCE(INSTANCE)

/******************************* I2S Instances ****************************/
#define IS_I2S_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_S) || ((INSTANCE) == SPI1_NS) || \
                                       ((INSTANCE) == SPI2_S) || ((INSTANCE) == SPI2_NS) || \
                                       ((INSTANCE) == SPI3_S) || ((INSTANCE) == SPI3_NS))

/****************************** SMBUS Instances *******************************/
#define IS_SMBUS_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_S) || ((INSTANCE) == I2C1_NS) || \
                                         ((INSTANCE) == I2C2_S) || ((INSTANCE) == I2C2_NS) || \
                                         ((INSTANCE) == I2C7_S) || ((INSTANCE) == I2C7_NS) || \
                                         ((INSTANCE) == I2C8_S) || ((INSTANCE) == I2C8_NS))

/************** SMBUS Instances : trigger input *********************************/
#define IS_SMBUS_TRIGGER_INPUT_INSTANCE(INSTANCE) (((INSTANCE) == I2C8_S) || ((INSTANCE) == I2C8_NS))

/******************************* IPCC Instances *******************************/
#define IS_IPCC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == IPCC1_S) || ((INSTANCE) == IPCC1_NS) || \
                                        ((INSTANCE) == IPCC2_S) || ((INSTANCE) == IPCC2_NS))
 
/******************************* IWDG Instances *******************************/
#define IS_IWDG_ALL_INSTANCE(INSTANCE) (((INSTANCE) == IWDG1_S) || ((INSTANCE) == IWDG1_NS) || \
                                        ((INSTANCE) == IWDG2_S) || ((INSTANCE) == IWDG2_NS) || \
                                        ((INSTANCE) == IWDG3_S) || ((INSTANCE) == IWDG3_NS) || \
                                        ((INSTANCE) == IWDG4_S) || ((INSTANCE) == IWDG4_NS) || \
                                        ((INSTANCE) == IWDG5_S) || ((INSTANCE) == IWDG5_NS))

/******************************* LPTIM Instances ******************************/
#define IS_LPTIM_INSTANCE(INSTANCE) (((INSTANCE) == LPTIM1_S) || ((INSTANCE) == LPTIM1_NS) || \
                                     ((INSTANCE) == LPTIM2_S) || ((INSTANCE) == LPTIM2_NS) || \
                                     ((INSTANCE) == LPTIM3_S) || ((INSTANCE) == LPTIM3_NS) || \
                                     ((INSTANCE) == LPTIM4_S) || ((INSTANCE) == LPTIM4_NS) || \
                                     ((INSTANCE) == LPTIM5_S) || ((INSTANCE) == LPTIM5_NS))

/****************** LPTIM Instances : DMA supported instances *****************/
#define IS_LPTIM_DMA_INSTANCE(INSTANCE)  (((INSTANCE) == LPTIM1_NS) || ((INSTANCE) == LPTIM1_S) || \
                                          ((INSTANCE) == LPTIM2_NS) || ((INSTANCE) == LPTIM2_S) || \
                                          ((INSTANCE) == LPTIM3_NS) || ((INSTANCE) == LPTIM3_S) || \
                                          ((INSTANCE) == LPTIM4_NS) || ((INSTANCE) == LPTIM4_S))

/************* LPTIM Instances : at least 1 capture/compare channel ***********/
#define IS_LPTIM_CC1_INSTANCE(INSTANCE) (((INSTANCE) == LPTIM1_NS)  || ((INSTANCE) == LPTIM1_S) || \
                                         ((INSTANCE) == LPTIM2_NS)  || ((INSTANCE) == LPTIM2_S) || \
                                         ((INSTANCE) == LPTIM3_NS)  || ((INSTANCE) == LPTIM3_S) || \
                                         ((INSTANCE) == LPTIM4_NS)  || ((INSTANCE) == LPTIM4_S) || \
                                         ((INSTANCE) == LPTIM5_NS)  || ((INSTANCE) == LPTIM5_S))

/************* LPTIM Instances : at least 2 capture/compare channel ***********/
#define IS_LPTIM_CC2_INSTANCE(INSTANCE) (((INSTANCE) == LPTIM1_NS) || ((INSTANCE) == LPTIM1_S) || \
                                         ((INSTANCE) == LPTIM2_NS) || ((INSTANCE) == LPTIM2_S) || \
                                         ((INSTANCE) == LPTIM3_NS) || ((INSTANCE) == LPTIM3_S) || \
                                         ((INSTANCE) == LPTIM4_NS) || ((INSTANCE) == LPTIM4_S))

/****************** LPTIM Instances : supporting encoder interface **************/
#define IS_LPTIM_ENCODER_INTERFACE_INSTANCE(INSTANCE)  (((INSTANCE) == LPTIM1_NS) || ((INSTANCE) == LPTIM1_S) || \
                                                        ((INSTANCE) == LPTIM2_NS) || ((INSTANCE) == LPTIM2_S))

